# Напишите функцию принимающую на вход только ключевые параметры и возвращающую словарь,
# где ключ — значение переданного аргумента, а значение — имя аргумента.
# Если ключ не хешируем, используйте его строковое представление. .

def parameters(**kwargs):
    result = {}
    for key, value in kwargs.items():
        try:
            result[value] = key
        except:
            result[str(value)] = key
    return result

print(parameters(name='Ivan', sername='Ivaniv', age=25, months=['April', 'May', 'June', 'July'], year={'2020': '2021', '2022': '2023'}))